In [1]:
from pandas import DataFrame, Series

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## a) DataFrame으로 위와 같은 자료를 만드시오

In [3]:
data = {'numbers': [10, 20, 30, 40]}

In [4]:
frame= DataFrame(data,index=['a', 'b', 'c', 'd'])
frame

   numbers
a       10
b       20
c       30
d       40

# b) C 로우의 값을 가져오시오

In [5]:
frame.loc['c']

numbers    30
Name: c, dtype: int64

# c) a,d 로우들의 값을 가져오시오.

In [6]:
frame.loc[['a','d']]

   numbers
a       10
d       40

## d) numbers의 합을 구하시오.

In [7]:
frame.sum()

numbers    100
dtype: int64

# e) numbers의 값들을 각각 제곱하시오 (vectorized operations 표현으로 예] 2*v )

In [8]:
frame*frame

   numbers
a      100
b      400
c      900
d     1600

## f) numbers의 값들을 각각 제곱하시오(apply 메서드 사용해서)

In [9]:
def f(frame):
    return frame*frame

In [10]:
frame.apply(f)

   numbers
a      100
b      400
c      900
d     1600

# f) numbers의 값들을 각각 제곱하시오(apply 메서드에, 람다 함수도 사용해서)

In [11]:
f= lambda x: x*x

In [12]:
frame.apply(f)

   numbers
a      100
b      400
c      900
d     1600

# g) floats라는 이름의 칼럼을 추가하시오. 값은 1.5, 2.5, 3.5, 4.5

In [13]:
frame['floats']=[1.5,2.5,3.5,4.5]
frame

   numbers  floats
a       10     1.5
b       20     2.5
c       30     3.5
d       40     4.5

# h) names라는 이름의 다음과 같은 칼럼을 위의 결과에 또 추가하시오.

In [14]:
frame['name']=['Guido','Felix','Francesc','Yves']
frame

   numbers  floats      name
a       10     1.5     Guido
b       20     2.5     Felix
c       30     3.5  Francesc
d       40     4.5      Yves

# i) 다음과 같은 정보를 가지는 로우(행)를 위의 결과에 추가하시오

In [15]:
#index:z, numbers: 100, floats: 5.75, names: Henry

In [16]:
frame.loc['z']=[100,5.75,'Henry']
frame

   numbers  floats      name
a       10    1.50     Guido
b       20    2.50     Felix
c       30    3.50  Francesc
d       40    4.50      Yves
z      100    5.75     Henry

# j) squares 라는 이름의 칼럼을 위의 결과에 추가하시오.
# 그런데 squares는 인덱스값이 짝이 맞지 않으므로 join 메서드를 사용하시오(기본옵션으로)

In [17]:
frame2=DataFrame({'squares': [1, 4,9, 16,25]},index=['a','b','c','d','y'])
frame2

   squares
a        1
b        4
c        9
d       16
y       25

In [18]:
frame.join(frame2)

   numbers  floats      name  squares
a       10    1.50     Guido      1.0
b       20    2.50     Felix      4.0
c       30    3.50  Francesc      9.0
d       40    4.50      Yves     16.0
z      100    5.75     Henry      NaN

# k) j와 동일하나 join 메서드의 옵션을 'outer'로 바꿔서 수행해보시오.

In [19]:
newframe=frame.join(frame2,how='outer')
newframe

   numbers  floats      name  squares
a     10.0    1.50     Guido      1.0
b     20.0    2.50     Felix      4.0
c     30.0    3.50  Francesc      9.0
d     40.0    4.50      Yves     16.0
y      NaN     NaN       NaN     25.0
z    100.0    5.75     Henry      NaN

l) 위의 결과로 나온 자료에서 numbers 칼럼과 squares 칼럼에 대해,
각각 평균을 구하시오. 다음과 같은 결과가 나와야 함.
(mean 메서드 사용, column-wise 계산)

In [20]:
newframe.mean()

numbers    40.00
floats      3.55
squares    11.00
dtype: float64

m) numbers와 squares 칼럼에 대해, 각각 표준편차를 구하시오
(std 메서드 사용, column-wise 계산)

In [21]:
newframe.std()

numbers    35.355339
floats      1.662077
squares     9.669540
dtype: float64

# (pandas 기본) 문제 2. DataFrame 다루기 (2)

  a) 표준정규분포를 따르는 9 X 4 형태의 DataFrame을 생성하시오

In [22]:
Tframe = DataFrame(np.random.randn(9, 4))
Tframe

          0         1         2         3
0  0.742136  0.228547  0.263884 -1.881605
1 -0.176882  1.723758 -0.415934  0.574106
2  1.218836  0.885719  1.443881  0.909818
3  2.240352  0.010311  1.087030  0.417260
4  0.601158  0.411299  1.326929  0.008007
5 -0.376117  0.114340 -0.589639  0.299565
6 -1.018271  0.160938  0.249186 -0.072817
7 -0.200440  1.584516  0.364010 -0.683235
8  0.802226 -1.951329  0.167689 -0.623175

b) a에서 생성한 DataFrame의 칼럼 이름을 - No1, No2, No2, No4로 지정하시오

In [23]:
##Tframe.reindex(columns=['No1','No2','No2','No4'],method='bfill')
Tframe.columns=['No1','No2','No2','No4']
Tframe

        No1       No2       No2       No4
0  0.742136  0.228547  0.263884 -1.881605
1 -0.176882  1.723758 -0.415934  0.574106
2  1.218836  0.885719  1.443881  0.909818
3  2.240352  0.010311  1.087030  0.417260
4  0.601158  0.411299  1.326929  0.008007
5 -0.376117  0.114340 -0.589639  0.299565
6 -1.018271  0.160938  0.249186 -0.072817
7 -0.200440  1.584516  0.364010 -0.683235
8  0.802226 -1.951329  0.167689 -0.623175

e) 위에서 생성된 자료에, 시간 관련 인덱싱을 하기 위해서는 DataTime 자료형을
생성해서 로우 인덱스에 넣어주는 방법이 있다. 아래코드를 실행하시오

In [24]:
dates=pd.date_range("2015-1-1",periods=9,freq="M")
Tframe.index=dates
Tframe

                 No1       No2       No2       No4
2015-01-31  0.742136  0.228547  0.263884 -1.881605
2015-02-28 -0.176882  1.723758 -0.415934  0.574106
2015-03-31  1.218836  0.885719  1.443881  0.909818
2015-04-30  2.240352  0.010311  1.087030  0.417260
2015-05-31  0.601158  0.411299  1.326929  0.008007
2015-06-30 -0.376117  0.114340 -0.589639  0.299565
2015-07-31 -1.018271  0.160938  0.249186 -0.072817
2015-08-31 -0.200440  1.584516  0.364010 -0.683235
2015-09-30  0.802226 -1.951329  0.167689 -0.623175

f) 각 컬럼의 평균을 구하시오

In [25]:
Tframe.mean()

No1    0.425889
No2    0.352011
No2    0.433004
No4   -0.116897
dtype: float64

f) 5월부터 7월까지의, 각 컬럼의 평균을 구하시오

In [26]:
Tframe[4:7].mean()

No1   -0.264410
No2    0.228859
No2    0.328825
No4    0.078252
dtype: float64